_Rarzrabotki/Kazna/Catalogs/НастройкиОбменаСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиОбменаСБанком</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбработкаИмпорта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаЭкспорта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПапкеОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработкиИмпорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработкиЭкспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Kazna/Catalogs/НастройкиОбменаСБанком/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКПапкеОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок              	= "Выберите каталог для выгрузки данных";
	ДиалогВыбораФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбораФайла.Каталог          			= Объект.ПутьКПапкеОбмена;

	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыборКаталогаЗавершение",
		ЭтотОбъект,
		Новый Структура(""));
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаСервере
Процедура ВыборКаталогаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры)
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	Иначе
		Объект.ПутьКПапкеОбмена	= ВыбранныеФайлы[0];
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		Если СправочникОбъект.ОбработкаИмпорта.Получить() = Неопределено Тогда
			Элементы.ИнформацияОбработкаИмпорта.Заголовок = "Обработка не загружена";
		Иначе
			Элементы.ИнформацияОбработкаИмпорта.Заголовок = СправочникОбъект.ИмяОбработкиИмпорта;
		КонецЕсли;
		Если СправочникОбъект.ОбработкаЭкспорта.Получить() = Неопределено Тогда
			Элементы.ИнформацияОбработкаЭкспорта.Заголовок = "Обработка не загружена";
		Иначе
			Элементы.ИнформацияОбработкаЭкспорта.Заголовок = СправочникОбъект.ИмяОбработкиЭкспорта;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОбОбработкеИмпортаНажатие(Элемент)
	
	АдресОбработкиИмпорта	= Неопределено;
	Обработчик				= Новый ОписаниеОповещения("ОбработкаВыбораФайлаВнешнейОбработки", ЭтотОбъект, Новый Структура("ИмяХранилища, ИмяОбработки", "ОбработкаИмпорта", "ИмяОбработкиИмпорта"));
	НачатьПомещениеФайла(Обработчик, АдресОбработкиИмпорта, "*.epf", Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораФайлаВнешнейОбработки(Результат, Адрес, ИмяФайла, ДополнительныеПараметры) 
	
	Если Результат = Истина Тогда
		ИмяФайла			= ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла).Имя;
		ДанныеФайла			= ПолучитьИзВременногоХранилища(Адрес);
		СправочникОбъект	= РеквизитФормыВЗначение("Объект");
		СправочникОбъект[ДополнительныеПараметры["ИмяХранилища"]]	= Новый ХранилищеЗначения(ДанныеФайла);
		СправочникОбъект[ДополнительныеПараметры["ИмяОбработки"]]	= ИмяФайла;
		СправочникОбъект.Записать();
		ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
		Элементы["Информация" + ДополнительныеПараметры["ИмяХранилища"]].Заголовок = ИмяФайла; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОбОбработкеЭкспортаНажатие(Элемент)
	
	АдресОбработкиИмпорта	= Неопределено;
	Обработчик				= Новый ОписаниеОповещения("ОбработкаВыбораФайлаВнешнейОбработки", ЭтотОбъект, Новый Структура("ИмяХранилища, ИмяОбработки", "ОбработкаЭкспорта", "ИмяОбработкиЭкспорта"));
	НачатьПомещениеФайла(Обработчик, АдресОбработкиЭкспорта, "*.epf", Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбработкуВФайл(ИмяРеквизита, ИмяОбработки)
	
	АдресОбработки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, ИмяРеквизита);
	
	Если ЗначениеЗаполнено(АдресОбработки) Тогда
		ПолучитьФайл(АдресОбработки, ИмяОбработки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлИмпортаВФайл(Команда)
	
	ВыгрузитьОбработкуВФайл("ОбработкаИмпорта", Объект.ИмяОбработкиИмпорта);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлЭкспортаВФайл(Команда)
	
	ВыгрузитьОбработкуВФайл("ОбработкаЭкспорта", Объект.ИмяОбработкиЭкспорта);
	
КонецПроцедуры
